renesas/ArduinoCore-rl78/variants/g23-fpb-64p/pins_arduino.h
#ifndef __RL78__
// #define digitalPinToInterrupt(p)  ((p) == 2 ? 0 : ((p) == 3 ? 1 : NOT_AN_INTERRUPT))
#else
// 2022/10/14 modified by KAD (changed from G13 board allocation)
// #define digitalPinToInterrupt(p)  ((p) == 2 ? 0 : ((p) == 3 ? 1 : (p) == 25 ? 2 : NOT_AN_INTERRUPT))
//#define digitalPinToInterrupt(p)  (((p) == 26) ? 0 : (((p) == 12) ? 1 : (((p) == 11) ? 2 : (((p) == 13) ? 3 : (((p) == 6) ? 4 : NOT_AN_INTERRUPT)))))
#define digitalPinToInterrupt(p)  (((p) == 26) ? 0 : (((p) == 12) ? 1 : (((p) == 11) ? 2 : (((p) == 13) ? 3 : (((p) == 6) ? 4 : (((p) == 7) ? 5 : (((p) == 4) ? 6 : NOT_AN_INTERRUPT)))))))

#endif

#ifdef __RL78__
/***************************************************************************/
/*    Macro Definitions                                                    */
/***************************************************************************/
#define ADDR_PORT_REG			0xFFFFFF00
#define ADDR_PORT_MODE_REG		0xFFFFFF20
#define ADDR_PORT_PULL_UP_REG	0xFFFF0030
#define	ADDR_PORT_IN_MODE_REG	0xFFFF0040
#define ADDR_PORT_OUT_MODE_REG	0xFFFF0050

/* Add for G23 */
#define ADDR_PORT_MODE_CONTROL_A_REG	0xFFFF0060
#define ADDR_PORT_MODE_CONTROL_T_REG	0xFFFF0260
#define ADDR_PORT_MODE_CONTROL_E_REG	0xFFFF0280
#define ADDR_PORT_OUT_CUR_CONTROL_REG	0xFFFF02A8
#define ADDR_PORT_DIG_INPUT_DIS_REG		0xFFFF02B0
/* Add for G23 */

#define ANALOG_PIN_0		2		// ANI2 (DIGITAL_PIN_51)
#define ANALOG_PIN_1		3		// ANI3 (DIGITAL_PIN_52)
#define ANALOG_PIN_2		4		// ANI4 (DIGITAL_PIN_53)
#define ANALOG_PIN_3		5		// ANI5 (DIGITAL_PIN_54)
#define ANALOG_PIN_4		6		// ANI6 (DIGITAL_PIN_55)
#define ANALOG_PIN_5		7		// ANI7 (DIGITAL_PIN_56)
/* add 2021.07.29 */
#define ANALOG_PIN_6		16		// ANI16(P03/RxD1) (DIGITAL_PIN_0)
#define ANALOG_PIN_7		17		// ANI17(P02/TxD1) (DIGITAL_PIN_1)
#define ANALOG_PIN_8		19		// ANI19(P120) (DIGITAL_PIN_29)
#define ANALOG_PIN_9		18		// ANI18(P147) (DIGITAL_PIN_40)

//#define ANALOG_PIN_6		18		// ANI18
//#define ANALOG_PIN_7		19		// ANI19

/* Port define. */
#define PORT_0				0
#define PORT_1				1
#define PORT_2				2
#define PORT_3				3
#define PORT_4				4
#define PORT_5				5
#define PORT_6				6
#define PORT_7				7
#define PORT_8				8
#define PORT_9				9
#define PORT_10				10
#define PORT_11				11
#define PORT_12				12
#define PORT_13				13
#define PORT_14				14
#define PORT_15				15

/* Port of digital pin define. */
#define DIGITAL_PIN_0		PORT_0	/* P03	*/
#define DIGITAL_PIN_1		PORT_0	/* P02	*/
#define DIGITAL_PIN_2		PORT_4	/* P43	*/
#define DIGITAL_PIN_3		PORT_4	/* P42	*/
#define DIGITAL_PIN_4		PORT_7	/* P77	*/
#define DIGITAL_PIN_5		PORT_4	/* P41	*/
#define DIGITAL_PIN_6		PORT_3	/* P31	*/
#define DIGITAL_PIN_7		PORT_7	/* P76	*/
#define DIGITAL_PIN_8		PORT_7	/* P73	*/
#define DIGITAL_PIN_9		PORT_0	/* P06	*/
#define DIGITAL_PIN_10		PORT_0	/* P05	*/
#define DIGITAL_PIN_11		PORT_5	/* P51	*/
#define DIGITAL_PIN_12		PORT_5	/* P50	*/
#define DIGITAL_PIN_13		PORT_3	/* P30	*/
#define DIGITAL_PIN_14		PORT_2	/* P40(REF)	*/ // P20->P40
#define DIGITAL_PIN_15		PORT_5	/* P52	*/
#define DIGITAL_PIN_16		PORT_5	/* P53	*/
#define DIGITAL_PIN_17		PORT_5	/* P54	*/
#define DIGITAL_PIN_18		PORT_5	/* P55	*/
#define DIGITAL_PIN_19		PORT_7	/* P70	*/
#define DIGITAL_PIN_20		PORT_7	/* P71	*/
#define DIGITAL_PIN_21		PORT_7	/* P72	*/
#define DIGITAL_PIN_22		PORT_7	/* P74	*/
#define DIGITAL_PIN_23		PORT_7	/* P75	*/
#define DIGITAL_PIN_24		PORT_12	/* P121	*/
#define DIGITAL_PIN_25		PORT_12	/* P122	*/
#define DIGITAL_PIN_26		PORT_13	/* P137	*/
#define DIGITAL_PIN_27		PORT_12	/* P123	*/
#define DIGITAL_PIN_28		PORT_12	/* P124	*/
#define DIGITAL_PIN_29		PORT_12	/* P120	*/
#define DIGITAL_PIN_30		PORT_0	/* P04 	*/

#define DIGITAL_PIN_31		PORT_1	/* P17	*/
#define DIGITAL_PIN_32		PORT_1	/* P16	*/
#define DIGITAL_PIN_33		PORT_1	/* P15	*/
#define DIGITAL_PIN_34		PORT_1	/* P14	*/
#define DIGITAL_PIN_35		PORT_1	/* P13	*/
#define DIGITAL_PIN_36		PORT_1	/* P12	*/
#define DIGITAL_PIN_37		PORT_1	/* P11	*/
#define DIGITAL_PIN_38		PORT_1	/* P10	*/
#define DIGITAL_PIN_39		PORT_14	/* P146	*/
#define DIGITAL_PIN_40		PORT_14	/* P147	*/
#define DIGITAL_PIN_41		PORT_2	/* P21 	*/
#define DIGITAL_PIN_42		PORT_13	/* P130	*/
#define DIGITAL_PIN_43		PORT_0	/* P01 	*/
#define DIGITAL_PIN_44		PORT_0	/* P00 	*/
#define DIGITAL_PIN_45		PORT_14	/* P141	*/
#define DIGITAL_PIN_46		PORT_14	/* P140	*/

/* For SDAA0,SCLA0 */
#define DIGITAL_PIN_47		PORT_6	/* P60	*/
#define DIGITAL_PIN_48		PORT_6	/* P61	*/
/* For SDAA1,SCLA1 */
#define DIGITAL_PIN_49		PORT_6	/* P62	*/
#define DIGITAL_PIN_50		PORT_6	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_51		PORT_2	/* P22	*/
#define DIGITAL_PIN_52		PORT_2	/* P23	*/
#define DIGITAL_PIN_53		PORT_2	/* P24	*/
#define DIGITAL_PIN_54		PORT_2	/* P25	*/
#define DIGITAL_PIN_55		PORT_2	/* P26	*/
#define DIGITAL_PIN_56		PORT_2	/* P27	*/
/* For A0-A6 */


/* Bit Num of digital pin define */
#define DIGITAL_PIN_BIT_0	0x03	/* P03	*/
#define DIGITAL_PIN_BIT_1	0x02	/* P02	*/
#define DIGITAL_PIN_BIT_2	0x03	/* P43	*/
#define DIGITAL_PIN_BIT_3	0x02	/* P42	*/
#define DIGITAL_PIN_BIT_4	0x07	/* P77	*/
#define DIGITAL_PIN_BIT_5	0x01	/* P41	*/
#define DIGITAL_PIN_BIT_6	0x01	/* P31	*/
#define DIGITAL_PIN_BIT_7	0x06	/* P76	*/
#define DIGITAL_PIN_BIT_8	0x03	/* P73	*/
#define DIGITAL_PIN_BIT_9	0x06	/* P06	*/
#define DIGITAL_PIN_BIT_10	0x05	/* P05	*/
#define DIGITAL_PIN_BIT_11	0x01	/* P51	*/
#define DIGITAL_PIN_BIT_12	0x00	/* P50	*/
#define DIGITAL_PIN_BIT_13	0x00	/* P30	*/
#define DIGITAL_PIN_BIT_14	0x00	/* P40(REF)	*/ // P20->P40
#define DIGITAL_PIN_BIT_15	0x02	/* P52	*/
#define DIGITAL_PIN_BIT_16	0x03	/* P53	*/
#define DIGITAL_PIN_BIT_17	0x04	/* P54	*/
#define DIGITAL_PIN_BIT_18	0x05	/* P55	*/
#define DIGITAL_PIN_BIT_19	0x00	/* P70	*/
#define DIGITAL_PIN_BIT_20	0x01	/* P71	*/
#define DIGITAL_PIN_BIT_21	0x02	/* P72	*/
#define DIGITAL_PIN_BIT_22	0x04	/* P74	*/
#define DIGITAL_PIN_BIT_23	0x05	/* P75	*/
#define DIGITAL_PIN_BIT_24	0x01	/* P121	*/
#define DIGITAL_PIN_BIT_25	0x02	/* P122	*/
#define DIGITAL_PIN_BIT_26	0x07	/* P137	*/
#define DIGITAL_PIN_BIT_27	0x03	/* P123	*/
#define DIGITAL_PIN_BIT_28	0x04	/* P124	*/
#define DIGITAL_PIN_BIT_29	0x00	/* P120	*/
#define DIGITAL_PIN_BIT_30	0x04	/* P04 	*/

