renesas/ArduinoCore-rl78/variants/g23-fpb-64p/pins_arduino.h
#define DIGITAL_PIN_BIT_31	0x07	/* P17	*/
#define DIGITAL_PIN_BIT_32	0x06	/* P16	*/
#define DIGITAL_PIN_BIT_33	0x05	/* P15	*/
#define DIGITAL_PIN_BIT_34	0x04	/* P14	*/
#define DIGITAL_PIN_BIT_35	0x03	/* P13	*/
#define DIGITAL_PIN_BIT_36	0x02	/* P12	*/
#define DIGITAL_PIN_BIT_37	0x01	/* P11	*/
#define DIGITAL_PIN_BIT_38	0x00	/* P10	*/
#define DIGITAL_PIN_BIT_39	0x06	/* P146	*/
#define DIGITAL_PIN_BIT_40	0x07	/* P147	*/
#define DIGITAL_PIN_BIT_41	0x01	/* P21 	*/
#define DIGITAL_PIN_BIT_42	0x00	/* P130	*/
#define DIGITAL_PIN_BIT_43	0x01	/* P01 	*/
#define DIGITAL_PIN_BIT_44	0x00	/* P00 	*/
#define DIGITAL_PIN_BIT_45	0x01	/* P141	*/
#define DIGITAL_PIN_BIT_46	0x00	/* P140	*/
                                
/* For SDAA0,SCLA0 */           
#define DIGITAL_PIN_BIT_47	0x00	/* P60	*/
#define DIGITAL_PIN_BIT_48	0x01	/* P61	*/
/* For SDAA1,SCLA1 */           
#define DIGITAL_PIN_BIT_49	0x02	/* P62	*/
#define DIGITAL_PIN_BIT_50	0x03	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_BIT_51	0x02	/* P22	*/
#define DIGITAL_PIN_BIT_52	0x03	/* P23	*/
#define DIGITAL_PIN_BIT_53	0x04	/* P24	*/
#define DIGITAL_PIN_BIT_54	0x05	/* P25	*/
#define DIGITAL_PIN_BIT_55	0x06	/* P26	*/
#define DIGITAL_PIN_BIT_56	0x07	/* P27	*/
/* For A0-A6 */

/* Bit mask of digital pin define. */
#define DIGITAL_PIN_MASK_0		0x08	/* P03	*/
#define DIGITAL_PIN_MASK_1		0x04	/* P02	*/
#define DIGITAL_PIN_MASK_2		0x08	/* P43	*/
#define DIGITAL_PIN_MASK_3		0x04	/* P42	*/
#define DIGITAL_PIN_MASK_4		0x80	/* P77	*/
#define DIGITAL_PIN_MASK_5		0x02	/* P41	*/
#define DIGITAL_PIN_MASK_6		0x02	/* P31	*/
#define DIGITAL_PIN_MASK_7		0x40	/* P76	*/
#define DIGITAL_PIN_MASK_8		0x08	/* P73	*/
#define DIGITAL_PIN_MASK_9		0x40	/* P06	*/
#define DIGITAL_PIN_MASK_10		0x20	/* P05	*/
#define DIGITAL_PIN_MASK_11		0x02	/* P51	*/
#define DIGITAL_PIN_MASK_12		0x01	/* P50	*/
#define DIGITAL_PIN_MASK_13		0x01	/* P30	*/
#define DIGITAL_PIN_MASK_14		0x01	/* P40(REF)	*/  // P20->P40
#define DIGITAL_PIN_MASK_15		0x04	/* P52	*/
#define DIGITAL_PIN_MASK_16		0x08	/* P53	*/
#define DIGITAL_PIN_MASK_17		0x10	/* P54	*/
#define DIGITAL_PIN_MASK_18		0x20	/* P55	*/
#define DIGITAL_PIN_MASK_19		0x01	/* P70	*/
#define DIGITAL_PIN_MASK_20		0x02	/* P71	*/
#define DIGITAL_PIN_MASK_21		0x04	/* P72	*/
#define DIGITAL_PIN_MASK_22		0x10	/* P74	*/
#define DIGITAL_PIN_MASK_23		0x20	/* P75	*/
#define DIGITAL_PIN_MASK_24		0x02	/* P121	*/
#define DIGITAL_PIN_MASK_25		0x04	/* P122	*/
#define DIGITAL_PIN_MASK_26		0x80	/* P137	*/
#define DIGITAL_PIN_MASK_27		0x08	/* P123	*/
#define DIGITAL_PIN_MASK_28		0x10	/* P124	*/
#define DIGITAL_PIN_MASK_29		0x01	/* P120	*/
#define DIGITAL_PIN_MASK_30		0x10	/* P04 	*/
                                        
#define DIGITAL_PIN_MASK_31		0x80	/* P17	*/
#define DIGITAL_PIN_MASK_32		0x40	/* P16	*/
#define DIGITAL_PIN_MASK_33		0x20	/* P15	*/
#define DIGITAL_PIN_MASK_34		0x10	/* P14	*/
#define DIGITAL_PIN_MASK_35		0x08 	/* P13	*/
#define DIGITAL_PIN_MASK_36		0x04	/* P12	*/
#define DIGITAL_PIN_MASK_37		0x02	/* P11	*/
#define DIGITAL_PIN_MASK_38		0x01	/* P10	*/
#define DIGITAL_PIN_MASK_39		0x40	/* P146	*/
#define DIGITAL_PIN_MASK_40		0x80	/* P147	*/
#define DIGITAL_PIN_MASK_41		0x02	/* P21 	*/
#define DIGITAL_PIN_MASK_42		0x01	/* P130	*/
#define DIGITAL_PIN_MASK_43		0x02	/* P01 	*/
#define DIGITAL_PIN_MASK_44		0x01	/* P00 	*/
#define DIGITAL_PIN_MASK_45		0x02	/* P141	*/
#define DIGITAL_PIN_MASK_46		0x01	/* P140	*/
                                        
/* For SDAA0,SCLA0 */                   
#define DIGITAL_PIN_MASK_47		0x01	/* P60	*/
#define DIGITAL_PIN_MASK_48		0x02	/* P61	*/
/* For SDAA1,SCLA1 */                   
#define DIGITAL_PIN_MASK_49		0x04	/* P62	*/
#define DIGITAL_PIN_MASK_50		0x08	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_MASK_51		0x04	/* P22	*/
#define DIGITAL_PIN_MASK_52		0x08	/* P23	*/
#define DIGITAL_PIN_MASK_53		0x10	/* P24	*/
#define DIGITAL_PIN_MASK_54		0x20	/* P25	*/
#define DIGITAL_PIN_MASK_55		0x40	/* P26	*/
#define DIGITAL_PIN_MASK_56		0x80	/* P27	*/
/* For A0-A6 */

/* Add for G23 PMCA & PMCT & PMCE */
#define DIGITAL_PIN_PMCA_0		0x08	/* P03	*/
#define DIGITAL_PIN_PMCA_1		0x04	/* P02	*/
#define DIGITAL_PIN_PMCA_2		0x00	/* P43	*/
#define DIGITAL_PIN_PMCA_3		0x00	/* P42	*/
#define DIGITAL_PIN_PMCA_4		0x00	/* P77	*/
#define DIGITAL_PIN_PMCA_5		0x00	/* P41	*/
#define DIGITAL_PIN_PMCA_6		0x00	/* P31	*/
#define DIGITAL_PIN_PMCA_7		0x00	/* P76	*/
#define DIGITAL_PIN_PMCA_8		0x00	/* P73	*/
#define DIGITAL_PIN_PMCA_9		0x00	/* P06	*/
#define DIGITAL_PIN_PMCA_10		0x00	/* P05	*/
#define DIGITAL_PIN_PMCA_11		0x00	/* P51	*/
#define DIGITAL_PIN_PMCA_12		0x00	/* P50	*/
#define DIGITAL_PIN_PMCA_13		0x00	/* P30	*/
#define DIGITAL_PIN_PMCA_14		0x01	/* P20(REF)	*/
#define DIGITAL_PIN_PMCA_15		0x00	/* P52	*/
#define DIGITAL_PIN_PMCA_16		0x00	/* P53	*/
#define DIGITAL_PIN_PMCA_17		0x00	/* P54	*/
#define DIGITAL_PIN_PMCA_18		0x00	/* P55	*/
#define DIGITAL_PIN_PMCA_19		0x00	/* P70	*/
#define DIGITAL_PIN_PMCA_20		0x00	/* P71	*/
#define DIGITAL_PIN_PMCA_21		0x00	/* P72	*/
#define DIGITAL_PIN_PMCA_22		0x00	/* P74	*/
#define DIGITAL_PIN_PMCA_23		0x00	/* P75	*/
#define DIGITAL_PIN_PMCA_24		0x00	/* P121	*/
#define DIGITAL_PIN_PMCA_25		0x00	/* P122	*/
#define DIGITAL_PIN_PMCA_26		0x00	/* P137	*/
#define DIGITAL_PIN_PMCA_27		0x00	/* P123	*/
#define DIGITAL_PIN_PMCA_28		0x00	/* P124	*/
#define DIGITAL_PIN_PMCA_29		0x01	/* P120	*/
#define DIGITAL_PIN_PMCA_30		0x00	/* P04 	*/
#define DIGITAL_PIN_PMCA_31		0x00	/* P17	*/
#define DIGITAL_PIN_PMCA_32		0x00	/* P16	*/
#define DIGITAL_PIN_PMCA_33		0x00	/* P15	*/
#define DIGITAL_PIN_PMCA_34		0x00	/* P14	*/
#define DIGITAL_PIN_PMCA_35		0x08 	/* P13	*/
#define DIGITAL_PIN_PMCA_36		0x00	/* P12	*/
#define DIGITAL_PIN_PMCA_37		0x00	/* P11	*/
#define DIGITAL_PIN_PMCA_38		0x00	/* P10	*/
#define DIGITAL_PIN_PMCA_39		0x00	/* P146	*/
#define DIGITAL_PIN_PMCA_40		0x80	/* P147	*/
#define DIGITAL_PIN_PMCA_41		0x02	/* P21 	*/
#define DIGITAL_PIN_PMCA_42		0x00	/* P130	*/
#define DIGITAL_PIN_PMCA_43		0x00	/* P01 	*/
#define DIGITAL_PIN_PMCA_44		0x00	/* P00 	*/
#define DIGITAL_PIN_PMCA_45		0x00	/* P141	*/
#define DIGITAL_PIN_PMCA_46		0x00	/* P140	*/
#define DIGITAL_PIN_PMCA_47		0x00	/* P60	*/
#define DIGITAL_PIN_PMCA_48		0x00	/* P61	*/
#define DIGITAL_PIN_PMCA_49		0x00	/* P62	*/
#define DIGITAL_PIN_PMCA_50		0x00	/* P63	*/

