renesas/ArduinoCore-rl78/variants/g23-fpb-64p/pins_arduino.h
/* For A0-A5 */
#define DIGITAL_PIN_PMCA_51		0x04	/* P22	*/
#define DIGITAL_PIN_PMCA_52		0x08	/* P23	*/
#define DIGITAL_PIN_PMCA_53		0x10	/* P24	*/
#define DIGITAL_PIN_PMCA_54		0x20	/* P25	*/
#define DIGITAL_PIN_PMCA_55		0x40	/* P26	*/
#define DIGITAL_PIN_PMCA_56		0x80	/* P27	*/
/* For A0-A6 */

#define DIGITAL_PIN_PMCT_0		0x00	/* P03	*/
#define DIGITAL_PIN_PMCT_1		0x00	/* P02	*/
#define DIGITAL_PIN_PMCT_2		0x00	/* P43	*/
#define DIGITAL_PIN_PMCT_3		0x00	/* P42	*/
#define DIGITAL_PIN_PMCT_4		0x80	/* P77	*/
#define DIGITAL_PIN_PMCT_5		0x00	/* P41	*/
#define DIGITAL_PIN_PMCT_6		0x02	/* P31	*/
#define DIGITAL_PIN_PMCT_7		0x40	/* P76	*/
#define DIGITAL_PIN_PMCT_8		0x08	/* P73	*/
#define DIGITAL_PIN_PMCT_9		0x40	/* P06	*/
#define DIGITAL_PIN_PMCT_10		0x20	/* P05	*/
#define DIGITAL_PIN_PMCT_11		0x00	/* P51	*/
#define DIGITAL_PIN_PMCT_12		0x01	/* P50	*/
#define DIGITAL_PIN_PMCT_13		0x01	/* P30	*/
#define DIGITAL_PIN_PMCT_14		0x00	/* P20(REF)	*/
#define DIGITAL_PIN_PMCT_15		0x00	/* P52	*/
#define DIGITAL_PIN_PMCT_16		0x00	/* P53	*/
#define DIGITAL_PIN_PMCT_17		0x00	/* P54	*/
#define DIGITAL_PIN_PMCT_18		0x00	/* P55	*/
#define DIGITAL_PIN_PMCT_19		0x01	/* P70	*/
#define DIGITAL_PIN_PMCT_20		0x02	/* P71	*/
#define DIGITAL_PIN_PMCT_21		0x04	/* P72	*/
#define DIGITAL_PIN_PMCT_22		0x10	/* P74	*/
#define DIGITAL_PIN_PMCT_23		0x20	/* P75	*/
#define DIGITAL_PIN_PMCT_24		0x00	/* P121	*/
#define DIGITAL_PIN_PMCT_25		0x00	/* P122	*/
#define DIGITAL_PIN_PMCT_26		0x00	/* P137	*/
#define DIGITAL_PIN_PMCT_27		0x00	/* P123	*/
#define DIGITAL_PIN_PMCT_28		0x00	/* P124	*/
#define DIGITAL_PIN_PMCT_29		0x00	/* P120	*/
#define DIGITAL_PIN_PMCT_30		0x00	/* P04 	*/
#define DIGITAL_PIN_PMCT_31		0x00	/* P17	*/
#define DIGITAL_PIN_PMCT_32		0x00	/* P16	*/
#define DIGITAL_PIN_PMCT_33		0x00	/* P15	*/
#define DIGITAL_PIN_PMCT_34		0x00	/* P14	*/
#define DIGITAL_PIN_PMCT_35		0x00 	/* P13	*/
#define DIGITAL_PIN_PMCT_36		0x00	/* P12	*/
#define DIGITAL_PIN_PMCT_37		0x00	/* P11	*/
#define DIGITAL_PIN_PMCT_38		0x00	/* P10	*/
#define DIGITAL_PIN_PMCT_39		0x00	/* P146	*/
#define DIGITAL_PIN_PMCT_40		0x00	/* P147	*/
#define DIGITAL_PIN_PMCT_41		0x00	/* P21 	*/
#define DIGITAL_PIN_PMCT_42		0x00	/* P130	*/
#define DIGITAL_PIN_PMCT_43		0x00	/* P01 	*/
#define DIGITAL_PIN_PMCT_44		0x00	/* P00 	*/
#define DIGITAL_PIN_PMCT_45		0x00	/* P141	*/
#define DIGITAL_PIN_PMCT_46		0x00	/* P140	*/
#define DIGITAL_PIN_PMCT_47		0x00	/* P60	*/
#define DIGITAL_PIN_PMCT_48		0x00	/* P61	*/
#define DIGITAL_PIN_PMCT_49		0x00	/* P62	*/
#define DIGITAL_PIN_PMCT_50		0x00	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_PMCT_51		0x04	/* P22	*/
#define DIGITAL_PIN_PMCT_52		0x08	/* P23	*/
#define DIGITAL_PIN_PMCT_53		0x10	/* P24	*/
#define DIGITAL_PIN_PMCT_54		0x20	/* P25	*/
#define DIGITAL_PIN_PMCT_55		0x40	/* P26	*/
#define DIGITAL_PIN_PMCT_56		0x80	/* P27	*/
/* For A0-A6 */

#define DIGITAL_PIN_PMCE_0		0x00	/* P03	*/
#define DIGITAL_PIN_PMCE_1		0x00	/* P02	*/
#define DIGITAL_PIN_PMCE_2		0x00	/* P43	*/
#define DIGITAL_PIN_PMCE_3		0x00	/* P42	*/
#define DIGITAL_PIN_PMCE_4		0x00	/* P77	*/
#define DIGITAL_PIN_PMCE_5		0x00	/* P41	*/
#define DIGITAL_PIN_PMCE_6		0x00	/* P31	*/
#define DIGITAL_PIN_PMCE_7		0x00	/* P76	*/
#define DIGITAL_PIN_PMCE_8		0x00	/* P73	*/
#define DIGITAL_PIN_PMCE_9		0x00	/* P06	*/
#define DIGITAL_PIN_PMCE_10		0x00	/* P05	*/
#define DIGITAL_PIN_PMCE_11		0x02	/* P51	*/
#define DIGITAL_PIN_PMCE_12		0x01	/* P50	*/
#define DIGITAL_PIN_PMCE_13		0x00	/* P30	*/
#define DIGITAL_PIN_PMCE_14		0x00	/* P20(REF)	*/
#define DIGITAL_PIN_PMCE_15		0x00	/* P52	*/
#define DIGITAL_PIN_PMCE_16		0x00	/* P53	*/
#define DIGITAL_PIN_PMCE_17		0x00	/* P54	*/
#define DIGITAL_PIN_PMCE_18		0x00	/* P55	*/
#define DIGITAL_PIN_PMCE_19		0x00	/* P70	*/
#define DIGITAL_PIN_PMCE_20		0x00	/* P71	*/
#define DIGITAL_PIN_PMCE_21		0x00	/* P72	*/
#define DIGITAL_PIN_PMCE_22		0x00	/* P74	*/
#define DIGITAL_PIN_PMCE_23		0x00	/* P75	*/
#define DIGITAL_PIN_PMCE_24		0x00	/* P121	*/
#define DIGITAL_PIN_PMCE_25		0x00	/* P122	*/
#define DIGITAL_PIN_PMCE_26		0x00	/* P137	*/
#define DIGITAL_PIN_PMCE_27		0x00	/* P123	*/
#define DIGITAL_PIN_PMCE_28		0x00	/* P124	*/
#define DIGITAL_PIN_PMCE_29		0x00	/* P120	*/
#define DIGITAL_PIN_PMCE_30		0x00	/* P04 	*/
#define DIGITAL_PIN_PMCE_31		0x80	/* P17	*/
#define DIGITAL_PIN_PMCE_32		0x40	/* P16	*/
#define DIGITAL_PIN_PMCE_33		0x20	/* P15	*/
#define DIGITAL_PIN_PMCE_34		0x10	/* P14	*/
#define DIGITAL_PIN_PMCE_35		0x08 	/* P13	*/
#define DIGITAL_PIN_PMCE_36		0x04	/* P12	*/
#define DIGITAL_PIN_PMCE_37		0x02	/* P11	*/
#define DIGITAL_PIN_PMCE_38		0x01	/* P10	*/
#define DIGITAL_PIN_PMCE_39		0x00	/* P146	*/
#define DIGITAL_PIN_PMCE_40		0x00	/* P147	*/
#define DIGITAL_PIN_PMCE_41		0x00	/* P21 	*/
#define DIGITAL_PIN_PMCE_42		0x00	/* P130	*/
#define DIGITAL_PIN_PMCE_43		0x02	/* P01 	*/
#define DIGITAL_PIN_PMCE_44		0x00	/* P00 	*/
#define DIGITAL_PIN_PMCE_45		0x00	/* P141	*/
#define DIGITAL_PIN_PMCE_46		0x00	/* P140	*/
#define DIGITAL_PIN_PMCE_47		0x01	/* P60	*/
#define DIGITAL_PIN_PMCE_48		0x02	/* P61	*/
#define DIGITAL_PIN_PMCE_49		0x00	/* P62	*/
#define DIGITAL_PIN_PMCE_50		0x00	/* P63	*/

/* For A0-A5 */
#define DIGITAL_PIN_PMCE_51		0x00	/* P22	*/
#define DIGITAL_PIN_PMCE_52		0x00	/* P23	*/
#define DIGITAL_PIN_PMCE_53		0x00	/* P24	*/
#define DIGITAL_PIN_PMCE_54		0x00	/* P25	*/
#define DIGITAL_PIN_PMCE_55		0x00	/* P26	*/
#define DIGITAL_PIN_PMCE_56		0x00	/* P27	*/
/* For A0-A6 */

/* Define Digital Pin CCDE */
#define DIGITAL_PIN_CCDE_0		0x00	/* P03	*/
#define DIGITAL_PIN_CCDE_1		0x00	/* P02	*/
#define DIGITAL_PIN_CCDE_2		0x00	/* P43	*/
#define DIGITAL_PIN_CCDE_3		0x00	/* P42	*/
#define DIGITAL_PIN_CCDE_4		0x00	/* P77	*/
#define DIGITAL_PIN_CCDE_5		0x00	/* P41	*/
#define DIGITAL_PIN_CCDE_6		0x00	/* P31	*/
#define DIGITAL_PIN_CCDE_7		0x00	/* P76	*/
#define DIGITAL_PIN_CCDE_8		0x00	/* P73	*/
#define DIGITAL_PIN_CCDE_9		0x00	/* P06	*/
#define DIGITAL_PIN_CCDE_10		0x00	/* P05	*/
#define DIGITAL_PIN_CCDE_11		0x04	/* P51	*/
#define DIGITAL_PIN_CCDE_12		0x08	/* P50	*/
#define DIGITAL_PIN_CCDE_13		0x00	/* P30	*/
#define DIGITAL_PIN_CCDE_14		0x00	/* P20(REF)	*/
#define DIGITAL_PIN_CCDE_15		0x00	/* P52	*/
#define DIGITAL_PIN_CCDE_16		0x00	/* P53	*/
#define DIGITAL_PIN_CCDE_17		0x00	/* P54	*/
#define DIGITAL_PIN_CCDE_18		0x00	/* P55	*/
#define DIGITAL_PIN_CCDE_19		0x00	/* P70	*/
#define DIGITAL_PIN_CCDE_20		0x00	/* P71	*/
#define DIGITAL_PIN_CCDE_21		0x00	/* P72	*/
#define DIGITAL_PIN_CCDE_22		0x00	/* P74	*/
#define DIGITAL_PIN_CCDE_23		0x00	/* P75	*/
#define DIGITAL_PIN_CCDE_24		0x00	/* P121	*/
#define DIGITAL_PIN_CCDE_25		0x00	/* P122	*/
#define DIGITAL_PIN_CCDE_26		0x00	/* P137	*/
#define DIGITAL_PIN_CCDE_27		0x00	/* P123	*/
#define DIGITAL_PIN_CCDE_28		0x00	/* P124	*/
#define DIGITAL_PIN_CCDE_29		0x00	/* P120	*/
#define DIGITAL_PIN_CCDE_30		0x00	/* P04 	*/
#define DIGITAL_PIN_CCDE_31		0x02	/* P17	*/
#define DIGITAL_PIN_CCDE_32		0x01	/* P16	*/
#define DIGITAL_PIN_CCDE_33		0x00	/* P15	*/
#define DIGITAL_PIN_CCDE_34		0x00	/* P14	*/
#define DIGITAL_PIN_CCDE_35		0x00 	/* P13	*/
#define DIGITAL_PIN_CCDE_36		0x00	/* P12	*/
#define DIGITAL_PIN_CCDE_37		0x00	/* P11	*/
#define DIGITAL_PIN_CCDE_38		0x00	/* P10	*/
#define DIGITAL_PIN_CCDE_39		0x00	/* P146	*/
#define DIGITAL_PIN_CCDE_40		0x00	/* P147	*/
#define DIGITAL_PIN_CCDE_41		0x00	/* P21 	*/
#define DIGITAL_PIN_CCDE_42		0x00	/* P130	*/
#define DIGITAL_PIN_CCDE_43		0x00	/* P01 	*/
#define DIGITAL_PIN_CCDE_44		0x00	/* P00 	*/
#define DIGITAL_PIN_CCDE_45		0x00	/* P141	*/
#define DIGITAL_PIN_CCDE_46		0x00	/* P140	*/
#define DIGITAL_PIN_CCDE_47		0x10	/* P60	*/
#define DIGITAL_PIN_CCDE_48		0x20	/* P61	*/
#define DIGITAL_PIN_CCDE_49		0x40	/* P62	*/
#define DIGITAL_PIN_CCDE_50		0x80	/* P63	*/

