renesas/ArduinoCore-rl78/variants/g23-fpb-64p/pins_arduino.h
#if defined(UART1_CHANNEL)
#define IS_PIN_SERIAL1(p)        ((p) == PIN_SERIAL1_RX || (p) == PIN_SERIAL1_TX)
#else
#define IS_PIN_SERIAL1(p)        (0)
#endif

#if defined(UART2_CHANNEL)
#define IS_PIN_SERIAL2(p)        ((p) == PIN_SERIAL2_RX || (p) == PIN_SERIAL2_TX)
#else
#define IS_PIN_SERIAL2(p)        (0)
#endif

#define IS_PIN_DIGITAL(p)       ((p) >= 0 && (p) < NUM_DIGITAL_PINS && (!(IS_PIN_SERIAL(p))))
#define IS_PIN_ANALOG(p)        ((p) >= 51 && (p) < 57)
#define IS_PIN_PWM(p)           digitalPinHasPWM(p)
#define IS_PIN_SERVO(p)         ((p) >= 0 && (p) < MAX_SERVOS)
#define IS_PIN_I2C(p)           ((p) == 47 || (p) == 48 || (p) == 49 || (p) == 50)
#define IS_PIN_SPI(p)           ((p) == SS || (p) == MOSI || (p) == MISO || (p) == SCK)
#define IS_PIN_SERIAL(p)        (IS_PIN_SERIAL0(p) || IS_PIN_SERIAL1(p) || IS_PIN_SERIAL2(p))
#define PIN_TO_DIGITAL(p)       (p)
#define PIN_TO_ANALOG(p)        ((p) - 51)
#define PIN_TO_PWM(p)           PIN_TO_DIGITAL(p)
#define PIN_TO_SERVO(p)         (p)
#define ANALOG_TO_PIN(p)        ((p) + 51)
/* Define Firmata library */


#ifdef ARDUINO_MAIN

// On the Arduino board, digital pins are also used
// for the analog output (software PWM).  Analog input
// pins are a separate set.

// ATMEL ATMEGA8 & 168 / ARDUINO
//
//                  +-\/-+
//            PC6  1|    |28  PC5 (AI 5)
//      (D 0) PD0  2|    |27  PC4 (AI 4)
//      (D 1) PD1  3|    |26  PC3 (AI 3)
//      (D 2) PD2  4|    |25  PC2 (AI 2)
// PWM+ (D 3) PD3  5|    |24  PC1 (AI 1)
//      (D 4) PD4  6|    |23  PC0 (AI 0)
//            VCC  7|    |22  GND
//            GND  8|    |21  AREF
//            PB6  9|    |20  AVCC
//            PB7 10|    |19  PB5 (D 13)
// PWM+ (D 5) PD5 11|    |18  PB4 (D 12)
// PWM+ (D 6) PD6 12|    |17  PB3 (D 11) PWM
//      (D 7) PD7 13|    |16  PB2 (D 10) PWM
//      (D 8) PB0 14|    |15  PB1 (D 9) PWM
//                  +----+
//
// (PWM+ indicates the additional PWM pins on the ATmega168.)

// ATMEL ATMEGA1280 / ARDUINO
//
// 0-7 PE0-PE7   works
// 8-13 PB0-PB5  works
// 14-21 PA0-PA7 works
// 22-29 PH0-PH7 works
// 30-35 PG5-PG0 works
// 36-43 PC7-PC0 works
// 44-51 PJ7-PJ0 works
// 52-59 PL7-PL0 works
// 60-67 PD7-PD0 works
// A0-A7 PF0-PF7
// A8-A15 PK0-PK7


// these arrays map port names (e.g. port B) to the
// appropriate addresses for various functions (e.g. reading
// and writing)
#ifndef __RL78__
const uint16_t PROGMEM port_to_mode_PGM[] = {
	NOT_A_PORT,
	NOT_A_PORT,
	(uint16_t) &DDRB,
	(uint16_t) &DDRC,
	(uint16_t) &DDRD,
};

const uint16_t PROGMEM port_to_output_PGM[] = {
	NOT_A_PORT,
	NOT_A_PORT,
	(uint16_t) &PORTB,
	(uint16_t) &PORTC,
	(uint16_t) &PORTD,
};

const uint16_t PROGMEM port_to_input_PGM[] = {
	NOT_A_PORT,
	NOT_A_PORT,
	(uint16_t) &PINB,
	(uint16_t) &PINC,
	(uint16_t) &PIND,
};

const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
	PD, /* 0 */
	PD,
	PD,
	PD,
	PD,
	PD,
	PD,
	PD,
	PB, /* 8 */
	PB,
	PB,
	PB,
	PB,
	PB,
	PC, /* 14 */
	PC,
	PC,
	PC,
	PC,
	PC,
};

const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
	_BV(0), /* 0, port D */
	_BV(1),
	_BV(2),
	_BV(3),
	_BV(4),
	_BV(5),
	_BV(6),
	_BV(7),
	_BV(0), /* 8, port B */
	_BV(1),
	_BV(2),
	_BV(3),
	_BV(4),
	_BV(5),
	_BV(0), /* 14, port C */
	_BV(1),
	_BV(2),
	_BV(3),
	_BV(4),
	_BV(5),
};

const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
	NOT_ON_TIMER, /* 0 - port D */
	NOT_ON_TIMER,
	NOT_ON_TIMER,
	// on the ATmega168, digital pin 3 has hardware pwm
#if defined(__AVR_ATmega8__)
	NOT_ON_TIMER,
#else
	TIMER2B,
#endif
	NOT_ON_TIMER,
	// on the ATmega168, digital pins 5 and 6 have hardware pwm
#if defined(__AVR_ATmega8__)
	NOT_ON_TIMER,
	NOT_ON_TIMER,
#else
	TIMER0B,
	TIMER0A,
#endif
	NOT_ON_TIMER,
	NOT_ON_TIMER, /* 8 - port B */
	TIMER1A,
	TIMER1B,
#if defined(__AVR_ATmega8__)
	TIMER2,
#else
	TIMER2A,
#endif
	NOT_ON_TIMER,
	NOT_ON_TIMER,
	NOT_ON_TIMER,
	NOT_ON_TIMER, /* 14 - port C */
	NOT_ON_TIMER,
	NOT_ON_TIMER,
	NOT_ON_TIMER,
	NOT_ON_TIMER,
};
#else


const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
		DIGITAL_PIN_0,
		DIGITAL_PIN_1,
		DIGITAL_PIN_2,
		DIGITAL_PIN_3,
		DIGITAL_PIN_4,
		DIGITAL_PIN_5,
		DIGITAL_PIN_6,
		DIGITAL_PIN_7,
		DIGITAL_PIN_8,
		DIGITAL_PIN_9,
		DIGITAL_PIN_10,
		DIGITAL_PIN_11,
		DIGITAL_PIN_12,
		DIGITAL_PIN_13,
		DIGITAL_PIN_14,
		DIGITAL_PIN_15,
		DIGITAL_PIN_16,
		DIGITAL_PIN_17,
		DIGITAL_PIN_18,
		DIGITAL_PIN_19,
		DIGITAL_PIN_20,
		DIGITAL_PIN_21,
		DIGITAL_PIN_22,
		DIGITAL_PIN_23,
		DIGITAL_PIN_24,
		DIGITAL_PIN_25,
		DIGITAL_PIN_26,
		DIGITAL_PIN_27,
		DIGITAL_PIN_28,
		DIGITAL_PIN_29,
		DIGITAL_PIN_30
};
#undef _offset

//#define _VB(mask) (uint8_t)(__builtin_log((uint8_t)mask) / __builtin_log(2))
#define _VB(mask) (uint8_t)(mask/2)

const uint8_t PROGMEM digital_pin_to_bit_PGM[] = {
		_VB(DIGITAL_PIN_MASK_0),
		_VB(DIGITAL_PIN_MASK_1),
		_VB(DIGITAL_PIN_MASK_2),
		_VB(DIGITAL_PIN_MASK_3),
		_VB(DIGITAL_PIN_MASK_4),
		_VB(DIGITAL_PIN_MASK_5),
		_VB(DIGITAL_PIN_MASK_6),
		_VB(DIGITAL_PIN_MASK_7),
		_VB(DIGITAL_PIN_MASK_8),
		_VB(DIGITAL_PIN_MASK_9),
		_VB(DIGITAL_PIN_MASK_10),
		_VB(DIGITAL_PIN_MASK_11),
		_VB(DIGITAL_PIN_MASK_12),
		_VB(DIGITAL_PIN_MASK_13),
		_VB(DIGITAL_PIN_MASK_14),
		_VB(DIGITAL_PIN_MASK_15),
		_VB(DIGITAL_PIN_MASK_16),
		_VB(DIGITAL_PIN_MASK_17),
		_VB(DIGITAL_PIN_MASK_18),
		_VB(DIGITAL_PIN_MASK_19),
		_VB(DIGITAL_PIN_MASK_20),
		_VB(DIGITAL_PIN_MASK_21),
		_VB(DIGITAL_PIN_MASK_22),
		_VB(DIGITAL_PIN_MASK_23),
		_VB(DIGITAL_PIN_MASK_24),
		_VB(DIGITAL_PIN_MASK_25),
		_VB(DIGITAL_PIN_MASK_26),
		_VB(DIGITAL_PIN_MASK_27),
		_VB(DIGITAL_PIN_MASK_28),
		_VB(DIGITAL_PIN_MASK_29),
		_VB(DIGITAL_PIN_MASK_30)
};

const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
		DIGITAL_PIN_MASK_0,
		DIGITAL_PIN_MASK_1,
		DIGITAL_PIN_MASK_2,
		DIGITAL_PIN_MASK_3,
		DIGITAL_PIN_MASK_4,
		DIGITAL_PIN_MASK_5,
		DIGITAL_PIN_MASK_6,
		DIGITAL_PIN_MASK_7,
		DIGITAL_PIN_MASK_8,
		DIGITAL_PIN_MASK_9,
		DIGITAL_PIN_MASK_10,
		DIGITAL_PIN_MASK_11,
		DIGITAL_PIN_MASK_12,
		DIGITAL_PIN_MASK_13,
		DIGITAL_PIN_MASK_14,
		DIGITAL_PIN_MASK_15,
		DIGITAL_PIN_MASK_16,
		DIGITAL_PIN_MASK_17,
		DIGITAL_PIN_MASK_18,
		DIGITAL_PIN_MASK_19,
		DIGITAL_PIN_MASK_20,
		DIGITAL_PIN_MASK_21,
		DIGITAL_PIN_MASK_22,
		DIGITAL_PIN_MASK_23,
		DIGITAL_PIN_MASK_24,
		DIGITAL_PIN_MASK_25,
		DIGITAL_PIN_MASK_26,
		DIGITAL_PIN_MASK_27,
		DIGITAL_PIN_MASK_28,
		DIGITAL_PIN_MASK_29,
		DIGITAL_PIN_MASK_30
};
#endif /*__RL78__*/


// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR   Serial
#define SERIAL_PORT_HARDWARE  Serial

#endif
#endif
